// #include "sys.h"
// #include "usart.h"
// #include "led.h"
// #include "raspberry.h"
// ////////////////////////////////////////////////////////////////////////////////// 	 
// //本程序只供学习使用，未经作者许可，不得用于其它任何用途
// //Mini STM32开发板
// //串口1初始化		   
// //正点原子@ALIENTEK
// //技术论坛:www.openedv.com
// //修改日期:2010/5/27
// //版本：V1.3
// //版权所有，盗版必究。
// //Copyright(C) 正点原子 2009-2019
// //All rights reserved
// //********************************************************************************
// //V1.3修改说明 
// //支持适应不同频率下的串口波特率设置.
// //加入了对printf的支持
// //增加了串口接收命令功能.
// //修正了printf第一个字符丢失的bug
// ////////////////////////////////////////////////////////////////////////////////// 	  
 

// //////////////////////////////////////////////////////////////////
// //加入以下代码,支持printf函数,而不需要选择use MicroLIB	  

// //////////////////////////////////////////////////////////////////

// #ifdef EN_UART2_RX   //如果使能了接收
// //串口1中断服务程序
// //注意,读取USARTx->SR能避免莫名其妙的错误   	
// u8 USART2_RX_BUF[USART_REC_LEN];     //接收缓冲,最大64个字节.
// //接收状态
// //bit7，接收完成标志
// //bit6，接收到0x0d
// //bit5~0，接收到的有效字节数目
// u8 USART2_RX_STA=0;       //接收状态标记	  
// u16 usart2[200];
// u16 t,i;


// u16 len;
// void UART2_IRQHandler(void)
// {
// 	u8 res;	    
// 	if(USART2->SR&(1<<5))//接收到数据
// 	{	 
// 		res=USART2->DR; 
// 		if((USART2_RX_STA&0x80)==0)//接收未完成
// 		{
// 			if(USART2_RX_STA&0x40)//接收到了0x0d
// 			{
// 				if(res!=0x0a)USART2_RX_STA=0;//接收错误,重新开始
// 				else USART2_RX_STA|=0x80;	//接收完成了 
// 			}else //还没收到0X0D
// 			{	
// 				if(res==0x0d)USART2_RX_STA|=0x40;
// 				else
// 				{
// 					USART2_RX_BUF[USART2_RX_STA&0X3F]=res;
// 					USART2_RX_STA++;
// 					if(USART2_RX_STA>(USART_REC_LEN-1))USART2_RX_STA=0;//接收数据错误,重新开始接收	  
// 				}		 
// 			}
// 		}  		 									     
// 	}  
										 
// } 
// #endif



